cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF12xJ.svd
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description>Pull-up Setting Register 0</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description>Pull-up Setting Register 1</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description>Pull-up Setting Register 2</description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description>Pull-up Setting Register 3</description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description>Pull-up Setting Register 4</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCRE" -->
        <register derivedFrom="PFRE">
          <name>PCRE</name>
          <description>Pull-up Setting Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "DDR0" -->
        <register>
          <name>DDR0</name>
          <description>Port input/output direction setting register 0</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000801A</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of DDR0</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR1" -->
        <register derivedFrom="PFR1">
          <name>DDR1</name>
          <description>Port input/output direction setting register 1</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "DDR2" -->
        <register derivedFrom="PFR2">
          <name>DDR2</name>
          <description>Port input/output direction setting register 2</description>
          <addressOffset>0x208</addressOffset>
        </register>
        <!-- REGISTER "DDR3" -->
        <register derivedFrom="PFR3">
          <name>DDR3</name>
          <description>Port input/output direction setting register 3</description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "DDR4" -->
        <register derivedFrom="PFR4">
          <name>DDR4</name>
          <description>Port input/output direction setting register 4</description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "DDRE" -->
        <register derivedFrom="PFRE">
          <name>DDRE</name>
          <description>Port input/output direction setting register E</description>
          <addressOffset>0x238</addressOffset>
        </register>
        <!-- REGISTER "PDIR0" -->
        <register derivedFrom="DDR0">
          <name>PDIR0</name>
          <description>Port input data register 0</description>
          <addressOffset>0x300</addressOffset>
        </register>
        <!-- REGISTER "PDIR1" -->
        <register derivedFrom="DDR1">
          <name>PDIR1</name>
          <description>Port input data register 1</description>
          <addressOffset>0x304</addressOffset>
        </register>
        <!-- REGISTER "PDIR2" -->
        <register derivedFrom="DDR2">
          <name>PDIR2</name>
          <description>Port input data register 2</description>
          <addressOffset>0x308</addressOffset>
        </register>
        <!-- REGISTER "PDIR3" -->
        <register derivedFrom="DDR3">
          <name>PDIR3</name>
          <description>Port input data register 3</description>
          <addressOffset>0x30C</addressOffset>
        </register>
        <!-- REGISTER "PDIR4" -->
        <register derivedFrom="DDR4">
          <name>PDIR4</name>
          <description>Port input data register 4</description>
          <addressOffset>0x310</addressOffset>
        </register>
        <!-- REGISTER "PDIRE" -->
        <register derivedFrom="DDRE">
          <name>PDIRE</name>
          <description>Port input data register E</description>
          <addressOffset>0x338</addressOffset>
        </register>
        <!-- REGISTER "PDOR0" -->
        <register derivedFrom="DDR0">
          <name>PDOR0</name>
          <description>Port output data register 0</description>
          <addressOffset>0x400</addressOffset>
        </register>
        <!-- REGISTER "PDOR1" -->
        <register derivedFrom="DDR1">
          <name>PDOR1</name>
          <description>Port output data register 1</description>
          <addressOffset>0x404</addressOffset>
        </register>
        <!-- REGISTER "PDOR2" -->
        <register derivedFrom="DDR2">
          <name>PDOR2</name>
          <description>Port output data register 2</description>
          <addressOffset>0x408</addressOffset>
        </register>
        <!-- REGISTER "PDOR3" -->
        <register derivedFrom="DDR3">
          <name>PDOR3</name>
          <description>Port output data register 3</description>
          <addressOffset>0x40C</addressOffset>
        </register>
        <!-- REGISTER "PDOR4" -->
        <register derivedFrom="DDR4">
          <name>PDOR4</name>
          <description>Port output data register 4</description>
          <addressOffset>0x410</addressOffset>
        </register>
        <!-- REGISTER "PDORE" -->
        <register derivedFrom="DDRE">
          <name>PDORE</name>
          <description>Port output data register E</description>
          <addressOffset>0x438</addressOffset>
        </register>
        <!-- REGISTER "ADE" -->
        <register>
          <name>ADE</name>
          <description>Analog input setting register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x07FFFFF7</resetValue>
          <resetMask>0x07FFFFF7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN14" -->
            <field>
              <name>AN14</name>
              <description>Bit14 of ADE</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN13" -->
            <field>
              <name>AN13</name>
              <description>Bit13 of ADE</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN12" -->
            <field>
              <name>AN12</name>
              <description>Bit12 of ADE</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN5" -->
            <field>
              <name>AN5</name>
              <description>Bit5 of ADE</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN4" -->
            <field>
              <name>AN4</name>
              <description>Bit4 of ADE</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN3" -->
            <field>
              <name>AN3</name>
              <description>Bit3 of ADE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN2" -->
            <field>
              <name>AN2</name>
              <description>Bit2 of ADE</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN1" -->
            <field>
              <name>AN1</name>
              <description>Bit1 of ADE</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
